{
  "backend/main.mo": "Defines user authentication, profiles, roles, onboarding state, and job application management using maps and authorization/storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Provides short descriptions of multiple frontend files covering routing, auth, onboarding, and role-specific flows.",
  "frontend/index.css": "Tailwind base and component layers plus CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with auth and backend actor providers.",
  "frontend/src/components/AppHeader.tsx": "Header displaying the app title and logout button when authenticated.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, optional navigation, main content area, and footer.",
  "frontend/src/components/AppNav.tsx": "Navigation bar showing role‑specific navigation actions for job seekers or recruiters.",
  "frontend/src/components/AsyncFallbackState.tsx": "Reusable component for loading, error, and empty states with optional actions and navigation helpers.",
  "frontend/src/features/actor/actorInitRetry.ts": "Implements a retry policy with exponential backoff for async initialization tasks.",
  "frontend/src/features/actor/BackendActorProvider.tsx": "Provides a React context that initializes and manages a backend actor with retry logic and exposes readiness state.",
  "frontend/src/features/auth/AuthContext.tsx": "Provides authentication state with login/logout and persists user email in session storage.",
  "frontend/src/features/auth/LoginPage.tsx": "Login UI that authenticates users through the backend actor and handles initialization and retry states.",
  "frontend/src/features/auth/RequireAuth.tsx": "Higher-order component that redirects unauthenticated users to the login page.",
  "frontend/src/features/auth/SignupPage.tsx": "Signup form that registers new users through the backend actor and handles initialization state.",
  "frontend/src/features/jobSeeker/JobSeekerApplyPage.tsx": "Job application form for job seekers allowing location entry and photo upload before submitting via the backend.",
  "frontend/src/features/jobSeeker/JobSeekerHomePage.tsx": "UI page for job seekers to view and edit their application, handle photo upload, and save updates via backend actor.",
  "frontend/src/features/jobSeeker/useMyApplication.ts": "React Query hook fetching the current user's job application, handling backend Result types and loading states.",
  "frontend/src/features/onboarding/LocationFormPage.tsx": "Onboarding form for submitting user location and routing users based on assigned role.",
  "frontend/src/features/onboarding/RequireOnboarding.tsx": "Wrapper enforcing onboarding steps with redirects and fallback states for loading or errors.",
  "frontend/src/features/onboarding/RoleSelectionPage.tsx": "Page allowing users to choose their role and persist it, handling backend errors and session issues.",
  "frontend/src/features/onboarding/useOnboardingStatus.ts": "Hook that loads the user's profile with React Query and exposes onboarding progress and status flags.",
  "frontend/src/features/recruiter/RecruiterBrowsePage.tsx": "Recruiter page listing applicants filtered by location, with loading/error handling and fallback states.",
  "frontend/src/features/recruiter/useApplicantsByLocation.ts": "Hook querying applicants near the recruiter's location using backend search and exposing query state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks, currently only imports common utilities.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/WelcomePage.tsx": "Renders a styled welcome screen with navigation to the login page.",
  "frontend/src/utils/backendErrors.ts": "Maps backend error codes to readable messages and actions, and provides helpers for handling result types.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, plugins, and dark mode settings.",
  "project_state.json": "Describes the app’s current project state, including features, architecture notes, and known issues related to login, role selection, and loading behavior. Serves as a fix request containing requirements for authentication, onboarding, and recruiter/job seeker flows."
}