{
  "backend/main.mo": "Motoko backend actor managing user registration, authentication, profiles, access control, and job applicant data with in‑memory maps and basic security checks.",
  "feature_evidence.json": "Feature evidence report mapping onboarding stability and retry improvements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend components, pages, and hooks across auth, onboarding, job seeker, and recruiter flows.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and global base styles for the frontend.",
  "frontend/index.html": "Root HTML document loading the React app via main.tsx and defining the mount point.",
  "frontend/src/App.tsx": "Main router configuration wiring all pages with AuthProvider, BackendActorProvider, and onboarding/auth route guards.",
  "frontend/src/components/AppHeader.tsx": "Header component showing the site title and a logout button that clears auth and query state.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing header, optional nav, content area, and footer branding.",
  "frontend/src/components/AppNav.tsx": "Role‑aware navigation bar linking to job seeker or recruiter sections based on onboarding profile state.",
  "frontend/src/features/actor/actorInitRetry.ts": "Implements a retry policy with exponential backoff for actor initialization.",
  "frontend/src/features/actor/BackendActorProvider.tsx": "Provides context for initializing and managing the backend actor with retry logic and query invalidation.",
  "frontend/src/features/auth/AuthContext.tsx": "Manages authentication state with login/logout and sessionStorage persistence.",
  "frontend/src/features/auth/LoginPage.tsx": "Login form that authenticates users and handles backend actor initialization states.",
  "frontend/src/features/auth/RequireAuth.tsx": "Route guard that redirects unauthenticated users to the login page.",
  "frontend/src/features/auth/SignupPage.tsx": "Signup form that registers new users through the backend actor.",
  "frontend/src/features/jobSeeker/JobSeekerApplyPage.tsx": "Allows job seekers to upload a photo and submit a job application with progress tracking.",
  "frontend/src/features/jobSeeker/JobSeekerHomePage.tsx": "Job seeker profile page allowing editing of personal details, location, and photo, with save and validation logic using actor API.",
  "frontend/src/features/jobSeeker/useMyApplication.ts": "Hook fetching the current user's job application via react-query, returning application data, loading state, and refetch.",
  "frontend/src/features/onboarding/LocationFormPage.tsx": "Onboarding page collecting user location and saving it through the actor before navigating based on role.",
  "frontend/src/features/onboarding/RequireOnboarding.tsx": "Wrapper enforcing onboarding steps with redirects and showing loading or error states based on profile and actor readiness.",
  "frontend/src/features/onboarding/RoleSelectionPage.tsx": "Onboarding page for choosing user role, saving it via actor, and navigating to the next onboarding step.",
  "frontend/src/features/onboarding/useOnboardingStatus.ts": "Hook fetching the user's onboarding profile with retry logic and exposing loading, fetched, and error states.",
  "frontend/src/features/recruiter/RecruiterBrowsePage.tsx": "Recruiter page listing applicants in the user's location, showing their details or an empty state.",
  "frontend/src/features/recruiter/useApplicantsByLocation.ts": "Hook fetching applicants filtered by the recruiter's location using actor API and react‑query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query hooks and currently imports core query utilities and useActor.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, dark mode values, and base utility styling.",
  "frontend/src/main.tsx": "Bootstraps the app by mounting React, configuring React Query, and wrapping the app with the Internet Identity provider.",
  "frontend/src/pages/WelcomePage.tsx": "Displays the branded welcome screen with a button that navigates users to the login page.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using URL parsing and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, fonts, and enabled plugins.",
  "project_state.json": "Project metadata documenting current feature implementations, requirements, issues, and architectural notes."
}