{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix role-selection messaging and add login recovery on authorization failures",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Remove any UI copy implying only admins can choose a role; replace with accurate English onboarding messaging that any logged-in user selects a role.",
      "acceptanceCriteria": [
        "No screen, alert, toast, or error message in the UI contains (or implies) \"only admins\" for role selection.",
        "Any replaced copy is in English and accurately reflects that role selection is available to any authenticated user on first login/onboarding."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/onboarding/RoleSelectionPage.tsx",
          "operation": "modify",
          "description": "Audit and update Role Selection page headings/descriptions (and any inline error copy) so nothing implies admin-only role selection, and the copy clearly states any logged-in user chooses their role during onboarding. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/backendErrors.ts",
          "operation": "modify",
          "description": "Audit mapped user-facing messages for role/auth related errors to ensure none reference admins and any role-selection-related messaging is accurate, clear English for authenticated users during onboarding. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/onboarding/RequireOnboarding.tsx",
          "operation": "modify",
          "description": "Audit onboarding gatekeeper fallback/error messages to ensure they do not mention or imply admin-only role selection and remain clear English for all logged-in users. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "On Role Selection, show clear non-admin authorization/session failure messaging and provide a Go to Login action while keeping role options usable when eligible.",
      "acceptanceCriteria": [
        "When the backend returns an authorization-related error during role selection, the UI shows a clear English message (no admin-related wording) and offers an actionable control to navigate to the Login page.",
        "Role selection remains available to all authenticated users who have not yet set a role (the two role option boxes remain present and usable when the user is eligible)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/onboarding/RoleSelectionPage.tsx",
          "operation": "modify",
          "description": "Handle authorization/session failures from role selection distinctly (e.g., backend Result error code or thrown auth error): show a clear English message guiding the user to log in again and render an explicit \"Go to Login\" action (can reuse AsyncFallbackState actions or an inline button using TanStack Router navigate). Ensure eligible users still see and can use both role option boxes. Use the selected \"authorization\" component guidance on handling authorization errors gracefully; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/backendErrors.ts",
          "operation": "modify",
          "description": "Ensure the authorization-related error mapping returns clear English guidance to re-authenticate (no admin wording) and supports driving a \"login\" action from the UI. Use the selected \"authorization\" component error-handling guidance; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AsyncFallbackState.tsx",
          "operation": "modify",
          "description": "Confirm the error-state action label and behavior for the login recovery path is suitable for role-selection authorization/session issues (\"Go to Login\"), and adjust only if needed to meet the requirement without introducing admin-related wording. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}